import Img from '../../images/pdf/pdf.png'
const users = [
    {"num":1, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":2, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":3, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img}, 
    {"num":4, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img}, 
    {"num":5, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img}, 
    {"num":6, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img}, 
    {"num":7, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "image" :Img},
    {"num":8, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":9, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":10, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img}, 
    {"num":11, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img}, 
    {"num":12, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img}, 
    {"num":13, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "image" :Img},
    {"num":14, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":15, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":13, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "image" :Img},
    {"num":14, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":15, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":13, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "image" :Img},
    {"num":14, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":15, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":13, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "image" :Img},
    {"num":14, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":15, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":13, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "image" :Img},
    {"num":14, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":15, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":13, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "image" :Img},
    {"num":14, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":15, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":13, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "image" :Img},
    {"num":14, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},
    {"num":15, "title": "ইনস্টিটিউট অব কম্পিউটার সায়েন্স এন্ড টেকনোলজি", "date": "০২-১২-২০২৪", "image" :Img},

] 

export const getUsers = function (page, limit) {
    let array = [];
    for (let i = (page - 1) * limit; i < (page * limit) && users[i]; i++){
        array.push(users[i]);
    }

    return array;
}

export const getLength = function () {
    return users.length;
}
